This notebook is to demonstrate pandas DS and basic data handling functionalities.

SERIES

In [ ]:
# import the libraries
import numpy as np
import pandas as pd

:

In [ ]:
# simple list as a series
list1= [10,20,30,40,50]

# convert this into a array
array1= pd.array(list1)

series_list= pd.Series(list1)
series_array= pd.Series(array1)
print(series_list)
print(series_array)

# Automatic indexing

0    10
1    20
2    30
3    40
4    50
dtype: int64
0    10
1    20
2    30
3    40
4    50
dtype: Int64

In [3]:
# Assigning index to every item in the list
list1_labeled= pd.Series(list1,index=["A", "B", "C", "D", "E"])
list1_labeled

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [4]:
# Retrieving some values
print(type(series_list))
print(series_list.shape)
print(series_list.values)
print(series_list.index)

<class 'pandas.core.series.Series'>
(5,)
[10 20 30 40 50]
RangeIndex(start=0, stop=5, step=1)

In [5]:
# dlist = [100,200,300,400,500]
label_list = ['Tata', 'Birla', 'Wipro', 'Infy', 'HCL']
ps1 = pd.Series(list1, index=label_list)  #  labelled series

# Indexing or other array operations
ps1["Tata"]

print(ps1["Tata":"Wipro"])

ps1['Birla':'HCL']
ps1['Birla':'HCL':2]

Tata     10
Birla    20
Wipro    30
dtype: int64

Birla    20
Infy     40
dtype: int64

In [6]:
# Applying mask or conditions to retrieve data
mask1= ps1>10
ps1[mask1]

Birla    20
Wipro    30
Infy     40
HCL      50
dtype: int64

DATA FRAMES  
    2 D data structure using labeled indexes (rows and columns)

In [7]:
#Creating a Pandas DataFrame using a list
student = ["Prakash", "Ramesh", "Ritvik", "Riyansh", "Vaibhav"]
df1= pd.DataFrame(student,columns=['Students'])
df1

  Students
0  Prakash
1   Ramesh
2   Ritvik
3  Riyansh
4  Vaibhav

In [10]:
#Creating a Pandas DataFrame using a dictionary
grades = ['A', "B", "B-", "A+", "A+"]
df2=pd.DataFrame({"Students":student, "Grades":grades})

# Accessing data
df2["Students"]
#df2[::12]

0    Prakash
1     Ramesh
2     Ritvik
3    Riyansh
4    Vaibhav
Name: Students, dtype: object

In [11]:
#accessing data from data frame
# loc method  - label based
df2.loc[1] 
df2.loc[1 , "Grades"]
df2.loc[4,"Students"]


# iloc -- index based
df2.iloc[3]

# Using iloc method

Students    Riyansh
Grades           A+
Name: 3, dtype: object

In [12]:
# add a new column

df2["location"] = ["BLR", "Chennai","Raj", "MP", "AP"]
df2

  Students Grades location
0  Prakash      A      BLR
1   Ramesh      B  Chennai
2   Ritvik     B-      Raj
3  Riyansh     A+       MP
4  Vaibhav     A+       AP

In [14]:
# drop a column
df2.drop("location", axis=1, inplace=True)
df2


#df2.drop("location", axis=1, inplace=True)

  Students Grades
0  Prakash      A
1   Ramesh      B
2   Ritvik     B-
3  Riyansh     A+
4  Vaibhav     A+

Combining Data

In [15]:
data_cust = pd.DataFrame({"customerID":['101','102','103','104'], 
                        'category': ['Medium','Medium','High','Low'],
                        'first_visit': ['yes','no','yes','yes'],
                        'sales': [123,52,214,663]},index=[0,1,2,3])


data_cust_new = pd.DataFrame({"customerID":['101','103','104','105'], 
                    'distance': [12,9,44,21],
                    'sales': [123,214,663,331]},index=[4,5,6,7])

data_cust

  customerID category first_visit  sales
0        101   Medium         yes    123
1        102   Medium          no     52
2        103     High         yes    214
3        104      Low         yes    663

In [ ]:
merged1 = pd.concat([data_cust,data_cust_new],axis=0)  # concatenates dataframes along a particular axis

merged1

In [ ]:
merged2=pd.merge(data_cust,data_cust_new,how='outer',on='customerID') # outer merge is union of on
merged2

In [ ]:
merged3= pd.merge(data_cust,data_cust_new,how='inner',on='customerID') # inner merge is intersection of on
merged3